[M_DemonicSouls MissionDefinition]
MissionDescription="You've met a skeleton who appears to need your help. He has asked you, somewhat cryptically, to return his souls to him. "
TeaserText="Amazing loot ahead! Bring a fire weapon."

[M_DemonicSouls:KillInvader MissionObjectiveDefinition]
ProgressMessage="Kill invader"

[M_DemonicSouls:KillInvader_ObjSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="You've met a soulless skeleton who appears to need your help. He has asked you, somewhat cryptically, to return his souls to him. After reviving the skeleton and renewing his human form, he asked for your help in defeating the invader who killed him in the first place."

[M_DemonicSouls:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionDescriptionOverride="You've met a soulless skeleton who appears to need your help. He has asked you, somewhat cryptically, to return his souls to him.  You will need to light some bonfires near the skeleton, kill the enemies that appear, and snag their souls. Once you've got enough, you will be able to give the skeleton his humanity back."
